#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Bubibi/netmemo-dev/runs/run-aci7nhSxC9rjeE2L

Waiting for the plan to start...

Terraform v1.0.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
nsxt_policy_tier1_gateway.tier1_gw: Refreshing state... [id=9ffd6390-031f-47c7-b1d1-e4a4bfd825f1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # nsxt_policy_tier1_gateway.tier1_gw has been deleted
  - resource "nsxt_policy_tier1_gateway" "tier1_gw" {
      - default_rule_logging      = false -> null
      - description               = "Tier-1 provisioned by Terraform" -> null
      - display_name              = "T1-TFC" -> null
      - enable_firewall           = true -> null
      - enable_standby_relocation = false -> null
      - failover_mode             = "PREEMPTIVE" -> null
      - force_whitelisting        = false -> null
      - id                        = "9ffd6390-031f-47c7-b1d1-e4a4bfd825f1" -> null
      - ipv6_dad_profile_path     = "/infra/ipv6-dad-profiles/default" -> null
      - ipv6_ndra_profile_path    = "/infra/ipv6-ndra-profiles/default" -> null
      - nsx_id                    = "9ffd6390-031f-47c7-b1d1-e4a4bfd825f1" -> null
      - path                      = "/infra/tier-1s/9ffd6390-031f-47c7-b1d1-e4a4bfd825f1" -> null
      - pool_allocation           = "ROUTING" -> null
      - revision                  = 0 -> null
      - route_advertisement_types = [
          - "TIER1_CONNECTED",
        ] -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # nsxt_policy_tier1_gateway.tier1_gw will be created
  + resource "nsxt_policy_tier1_gateway" "tier1_gw" {
      + default_rule_logging      = false
      + description               = "Tier-1 provisioned by Terraform"
      + display_name              = "T1-TFC"
      + edge_cluster_path         = (known after apply)
      + enable_firewall           = true
      + enable_standby_relocation = false
      + failover_mode             = "PREEMPTIVE"
      + force_whitelisting        = false
      + id                        = (known after apply)
      + ipv6_dad_profile_path     = (known after apply)
      + ipv6_ndra_profile_path    = (known after apply)
      + nsx_id                    = (known after apply)
      + path                      = (known after apply)
      + pool_allocation           = "ROUTING"
      + revision                  = (known after apply)
      + route_advertisement_types = [
          + "TIER1_CONNECTED",
        ]

      + intersite_config {
          + fallback_site_paths = (known after apply)
          + primary_site_path   = (known after apply)
          + transit_subnet      = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @netmemo, Action: `pull_request`*